--更新手順
--①本スクリプト実行
--②①の実行結果を「データ/keisu2g-2025.csv」へ上書きコピペ
--③高計数現場一覧表作成（202304～).xlsを開き、「データ取込処理」⇒最新の対象年月を入力⇒計数は「-100」を入力
--④Sheet1のシート保護を解除　Sheet2の前期総合計と、前期実績比較をSheet1の最後尾にコピペ　該当月まで比較額表示されるようにする
--⑤③のSheet1を新規ファイルにコピーし、現場計数.xlsxに上書き

select 
部門CD as 部門ＣＤ
,現場CD as 現場ＣＤ
,年月 as 処理年月
,現場名 as 現場名
,固定売上 as 自社固定
,臨時売上 as 自社臨時
,0 as 外注固定
,0 as 外注臨時
,0 as 物品売上
,0 as 食堂売上
,0 as 総売上
,0 as 基本給
,0 as 諸手当
,0 as 臨時手当
,0 as 回数１手当
,0 as 回数２手当
,0 as 残業手当
,0 as 深夜手当
,0 as 休出手当
,0 as 延長手当
,0 as 通勤手当
,0 as 社会保険
,人件費 as 総支給額
,0 as [応援＋]
,0 as [応援－]
,0 as 日勤時間
,0 as ﾊﾟｰﾄ時間
,0 as 日勤人数
,0 as ﾊﾟｰﾄ人数
,諸経費 as 材料費
,0 as 旧被服費
,0 as 旧監視機械費
,0 as 現場旅費交通費
,0 as 現場福利厚生費
,0 as 現場通信費
,0 as 現場雑費
,0 as 旧現場雑損
,0 as 現場車両費
,0 as 契約外注費
,0 as 臨時外注費
,0 as 仕入商品
,0 as 旧物品仕入商品
,0 as 稼働率
,0 as 現場リース料
from dbo.kanrikeisuu where 年月 between '202504' and '202603' and 現場CD not like '%9900'

--select * from dbo.kanrikeisuu where 部門CD like '%4050'